<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <title>Jewelry Workshop</title>
  <link rel="stylesheet" href="css/main.css">
</head>
<body>
  <header>
    <div id="logo" onclick="slowScroll('#top')">
      <span>MGM</span>
    </div>
    <div id="about">
      <a href="#" title="about" onclick="slowScroll('#main')">О нас</a>
      <a href="zak.php" title="Заказ"><!--onclick="slowScroll('#main')"-->Заказ изделия</a>
      <a href="rep.php" title="Ремонт" onclick="slowScroll('#overview')">Ремонт изделия</a>
      <a href="#" title="Контакты" onclick="slowScroll('#contacts')">Контакты</a>
      <a href="#" title="Информация" onclick="slowScroll('#info')">Информация</a>
      <!--<a href="#" title="Ответы на вопросы" onclick="slowScroll('#faq')">FAQ</a>-->
    </div>
  </header>

  <div id="top">
    <h1>Добро пожаловать </h1>
    <h2>в Ювелирную мастерскую</h2>
    <h3>MGM!</h3>
  </div>

  <div id="main">
    <div class="intro">
      <h2>Добро пожаловать!</h2>
      <span>У нас большой выбор всего, что может вам пригодиться:</span><br>
      <br>
      <span>Ждем вас по адресу: Домодедово, Корнеева ул., 1.</span>
    </div>

    <div class="text">
      <span><b>Наша мастерская рада видеть вас на нашей странице!</b><br>
      Мы работаем в ювелирной отрасли более 10 лет. В нашей команде работают квалифицированные и опытные специалисты в своей области.
      Мы всегда готовы сделать ремонт или изготовить изделие быстро, качественно, а главное, с гарантией и по доступной цене!<br>
      Если вы хотите оригинальные, красивые или эксклюзивные украшения, вы нашли то, что искали! Мы изготовим для вас новые украшения!
      Мы можем вернуть старому убранству свежий вид, похожий на новый, а именно, отремонтировать и восстановить ваш товар!
      Если у вас есть собственная идея или дизайнерская идея, мы можем перевести ее на металл.<br>
      Сделав заказ у нас, вы получите уникальное украшение, созданное в соответствии с вашими пожеланиями!</span>
    </div>
  </div>

  <div id="overview">
    <h2>Примеры</h2>
    <h4>наших работ</h4>

    <div class="img">
      <img src="https://pp.userapi.com/c846217/v846217158/dcbf/xV_mb2vmGdY.jpg" alt="">
      <span>Золотой браслет Вес: 13,5 г. Плетение Лисий хвост</span>
    </div>
    <div class="img">
      <img src="https://pp.userapi.com/c840331/v840331192/310c/tqJGKd-JDjk.jpg" alt="">
      <span>До и После реставрации серебряного подстаканника</span>
    </div>
    <div class="img">
      <img src="https://pp.userapi.com/c638030/v638030989/45ee6/3fsOfH_BA3o.jpg" alt="">
      <span>Реконструкция обручальных колец.</span>
    </div>
    <div class="img">
      <img src="https://pp.userapi.com/c638030/v638030989/47f23/_SY3kmpqYEk.jpg" alt="">
      <span>Цепь плетения Бисмарк Металл: золото 585 пробы Вес: 120 грамм</span>
    </div>
  </div>

  <!--<div id="contacts">
    <center><h5>Обратная связь</h5></center>
    <form id="form_input">
      <label for="name">Имя <span>*</span></label><br>
      <input type="text" placeholder="Введите имя" name="name" id="name"><br>
      <label for="email">Ваша почта <span>*</span></label><br>
      <input type="email" placeholder="Введите email" name="email" id="email"><br>
      <label for="message">Сообщение <span>*</span></label><br>
      <textarea placeholder="Введите ваше сообщение" name="message" id="message"></textarea><br>
      <div id="mess_send" class="btn">Отправить</div>
    </form>
  </div>-->

<div id="info">
  <h2>Больше информации </h2>
  <h4>о нашей мастерской</h4>
</div>
  <div id="faq">
    <div class="news">
      <p>❗Только у нас!❗<br>
        Мы ценим время наших клиентов! И с вниманием подходим  к каждому заказу😊 Настала холодная пора.<br>
        ❗Поэтому!❗<br>
        Если Ваш заказ на требует чуть-чуть терпения и времени, например,минут 15, то мы рады угостить Вас чашечкой кофе или чая!
        Для удобства в нашей ювелирной мастерской MGM есть гостевой столик со стульчиком, где Вы сможете отвлечься📱 от суеты, и насладиться согревающим напитком👍❗
        Также всегда в наличии каталоги📚 изделий и клиентоориентированный и гостеприимный ювелир!❗<br>
        <br>
        Ждём  Вас по Адресу: Домодедово, ул. Корнеева,  д.1  вход со стороны ж/д Станции ❗#ТЦСфера !</p>
    </div>
    <div class="news">
      <p>❗Друзья, не экономьте на любимых!❗<br>
      Друзья, не экономьте на любимых!<br>
      А если, все-таки бюджет ограничен,  мы сделаем все, чтобы Ваше "золото" никогда не прожелтело!<br>
      Для этого существует методика Родирования и золочения, как бижутерии так и драг.металлов!<br>
      Приходите к нам по адресу: 🏤  Домодедово, ул.Корнеева, д.1<br>
      <br>
      ❗Звоните ☏ 8 926 710 93 11❗<br>
      ❗Пишите: Администраторам  сайта или в сообщения группы❗</p>
       <a href="https://vk.com/michael_gold_man">Группа VK</a>
    </div>
    <div class="news">
      <p>❗Уважаемые клиенты!❗<br>
      Рады сообщить, что при обращении через данную страничку группы мы предоставляем Вам:<br>
      ✔ 10% скидку на изготовление<br>
      ✔ 20% скидку на ремонт изделий<br>
      <br>
      По всем интересующим ❓вопросам❓, просьба обращаться к Администраторам группы.</p>
    </div>
  </div>

  <div id="contacts">
    <center><h5>Обратная связь</h5></center>
    <form id="form_input" method="get">
      <label for="surname">Фамилия <span>*</span></label><br>
      <input type="text" placeholder="Введите фамилию" name="surname" id="surname"><br>

      <label for="name">Имя <span>*</span></label><br>
      <input type="text" placeholder="Введите имя" name="name" id="name"><br>

      <label for="middlename">Отчество </label><br>
      <input type="text" placeholder="Введите отчество" name="middlename" id="middlename"><br>

      <label for="phone">Телефон <span>*</span></label><br>
      <input type="text" placeholder="Введите телефон" name="phone" id="phone"><br>

      <label for="email">Ваша почта <span>*</span></label><br>
      <input type="text" placeholder="Введите email" name="email" id="email"><br>

      <label for="message">Сообщение <span>*</span></label><br>
      <textarea placeholder="Введите ваше сообщение" name="message" id="message"></textarea><br>
      <input type="submit" name="formSubmit" value="Отправить">
      <!--<div id="mess_send" class="btn" name="formSubmit">Отправить</div>-->
    </form>
    <?php
      if (isset($_GET['formSubmit'])) {
        $surnameF=$_GET['surname'];
        $nameF=$_GET['name'];
        $middlenameF=$_GET['middlename'];
        $phoneF=$_GET['phone'];
        $emailF=$_GET['email'];
        $messageF=$_GET['message'];
        $mysqli = new mysqli("localhost", "root", "", "мастерская");
        if ($mysqli->connect_errno) {
          echo "Извините, произошла ошибка с подключением";
          exit;
        }
        $surname = '"'.$mysqli->real_escape_string($surnameF).'"';
        $name = '"'.$mysqli->real_escape_string($nameF).'"';
        $middlename = '"'.$mysqli->real_escape_string($middlenameF).'"';
        $phone = '"'.$mysqli->real_escape_string($phoneF).'"';
        $email = '"'.$mysqli->real_escape_string($emailF).'"';
        $message = '"'.$mysqli->real_escape_string($messageF).'"';
        $query = "INSERT INTO Связь (фамилия,	имя, отчество, телефон,	почта, сообщение) VALUES ($surname, $name, $middlename, $phone, $email, $message)";
        $result = $mysqli->query($query);
        if ($result) {
          print('Спасибо'. '<br>');
        }
        $mysqli->close();
      }
    ?>
  </div>

  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.6.1/jquery.min.js"></script>
  <script type="text/javascript">
    function slowScroll(id) {
      $('html, body').animate({
        scrollTop: $(id).offset().top
      }, 500);
    }

    $(document).on("scroll", function () {
      if($(window).scrollTop() === 0)
        $("header").removeClass("fixed");
      else
        $("header").attr("class", "fixed");
    })
  </script>
</body>
</html>
